### Import your data into a Pandas DataFrame.

### Merge your DataFrames.

### Create a bubble chart that showcases the average fare versus the total number of rides with bubble size based on the total number of drivers for each city type, including urban, suburban, and rural.

### Determine the mean, median, and mode for the following:

    #### The total number of rides for each city type.

    #### The average fares for each city type.

    #### The total number of drivers for each city type.

### Create box-and-whisker plots that visualize each of the following to determine if there are any outliers:

    #### The number of rides for each city type.

    #### The fares for each city type.

    #### The number of drivers for each city type.

### Create a pie chart that visualizes each of the following data for each city type:

    #### The percent of total fares.

    #### The percent of total rides.

    #### The percent of total drivers.

In [2]:
%matplotlib inline

In [3]:
#Import your data into a Pandas DataFrame and add dependincies
import pandas as pd
import matplotlib.pyplot as plt
import statistics as stats
import numpy as np

city_data_to_load = 'Resources/city_data.csv'
ride_data_to_load = 'Resources/ride_data.csv'

In [4]:
#Actually Reading in the csv files
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [5]:
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [6]:

city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [7]:
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [8]:
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [9]:
city_data_df['type'].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [10]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban")

66

In [11]:
sum(city_data_df["type"]=="Suburban")

36

In [12]:
sum(city_data_df['type']=='Rural')

18

In [13]:
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [14]:
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [15]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [16]:
#Merge cells only related column is city and ride data has more rows so I should be adding city data to ride data
#Database to the rescue merge left is similar to left join in SQL

#https://stackoverflow.com/questions/27556377/pandas-combine-data-frames-of-different-sizes

pyber_data_df = ride_data_df.merge(city_data_df, on='city', how='left').copy()
pyber_data_df.head()

#or I could've just followed along
#new_df = pd.merge(leftdf, rightdf, on=["column_leftdf", "column_rightdf"], how='left')

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [ ]:
bigdata_df.count()

In [ ]:
bigdata_df.isnull().sum()